
#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура ЗполнитьНужное(Команда)  
	ОчиститьСообщения();
	ЗполнитьНужноеНаСервере();  	
КонецПроцедуры

&НаСервере
Процедура ЗполнитьНужноеНаСервере() 
	
	МодульОбъекта = РеквизитФормыВЗначение("Объект");
	МодульОбъекта.ВедомостиДобавить(Объект.Ведомости,Объект.Равно,Объект.Максимум);
	
	ПараметрыУсловногоОформления();

КонецПроцедуры    


&НаКлиенте
Процедура УдалитьЛишнее(Команда)
	ОчиститьСообщения();
	УдалитьЛишнееНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьЛишнееНаСервере()
	
    МодульОбъекта = РеквизитФормыВЗначение("Объект");
	МодульОбъекта.ВедомостиУдалить(Объект.Ведомости);                   	
	
	ПараметрыУсловногоОформления();

КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура ПараметрыУсловногоОформления()
	
	МассивИменКолонокДляПодсветки = Новый Массив;
    Для каждого Строка из Элементы.Ведомости.ПодчиненныеЭлементы Цикл
        МассивИменКолонокДляПодсветки.Добавить(Строка.Имя);
    КонецЦикла;
    
    ЭлементОформления = УсловноеОформление.Элементы.Добавить();
    ЭлементОформления.Использование = Истина;
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",  Новый Цвет(204, 255, 204));
    
    ЭлементУсловия                = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Ведомости.Статус");
    ЭлементУсловия.ПравоеЗначение = Перечисления.СтатусыДокументов.Акцептован;
    ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;   
    ЭлементУсловия.Использование  = Истина;
    
    Для каждого ТекЭлемент из МассивИменКолонокДляПодсветки Цикл
        ОформляемоеПоле      = ЭлементОформления.Поля.Элементы.Добавить();
        ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТекЭлемент);
    КонецЦикла;

	

КонецПроцедуры

#КонецОбласти
