//  Функция СведенияОВнешнейОбработке() Экспорт
//	
//	ВерсияБсп = СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
//	РегистрационныеДанные = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(ВерсияБсп);
//	РегистрационныеДанные.Наименование = "Выборка ведомости по договору";
//	РегистрационныеДанные.БезопасныйРежим = Ложь;
//	РегистрационныеДанные.Версия = "1.0";

//	РегистрационныеДанные.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
//	
//	РегистрационныеДанные.Информация = "Обработка отображает ведомости где дата первого активного договора 
//										|равна (или не равна) минимальной (или максимальной) дате начала действия договора";
//		
//	СтрокаКоманды = РегистрационныеДанные.Команды.Добавить();
//	СтрокаКоманды.Идентификатор = "ВыборкаВедомостиПоДоговору";
//	СтрокаКоманды.Представление = "Выборка ведомости по договору";
//	СтрокаКоманды.ПоказыватьОповещение = Ложь;
//	СтрокаКоманды.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы(); 
//			
//	Возврат РегистрационныеДанные;
//	
//КонецФункции

// Процедура - Ведомости добавить
//
// Параметры:
//  ТЧВедомости	 - ТабличнаяЧасть - Табличная часть "Ведомости" с формы обработки
//  ЭтоРавно	 - Булево - Знак равенства для вычесления
//  ЭтоМаксимум	 - Булево - Значение максимум или минимум для вычесления
Процедура ВедомостиДобавить(ТЧВедомости,ЭтоРавно,ЭтоМаксимум) Экспорт  
	
	ТЧВедомости.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВедомостьДоговоры.Ссылка КАК Ссылка,
		|	ВедомостьДоговоры.НомерСтроки КАК НомерСтроки,
		|	ВедомостьДоговоры.Договор КАК Договор,
		|	сДоговоры.Дата КАК Дата
		|ПОМЕСТИТЬ ВТ_ТЧДоговоры
		|ИЗ
		|	Документ.Ведомость.Договоры КАК ВедомостьДоговоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК сДоговоры
		|		ПО ВедомостьДоговоры.Договор = сДоговоры.Ссылка
		|ГДЕ
		|	(ВедомостьДоговоры.Ссылка, ВедомостьДоговоры.НомерСтроки) В
		|			(ВЫБРАТЬ
		|				ВедомостьДоговоры.Ссылка КАК Ссылка,
		|				МИНИМУМ(ВедомостьДоговоры.НомерСтроки) КАК НомерСтроки
		|			ИЗ
		|				Документ.Ведомость.Договоры КАК ВедомостьДоговоры
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК сДоговоры
		|					ПО
		|						ВедомостьДоговоры.Договор = сДоговоры.Ссылка
		|			ГДЕ
		|				сДоговоры.Активен = ИСТИНА
		|			СГРУППИРОВАТЬ ПО
		|				ВедомостьДоговоры.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВедомостьДоговоры.Ссылка КАК Ссылка,
		|	МИНИМУМ(сДоговоры.Дата) КАК Дата
		|ПОМЕСТИТЬ ВТ_СгрупировваняДатаДоговораПоВедомости
		|ИЗ
		|	Документ.Ведомость.Договоры КАК ВедомостьДоговоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК сДоговоры
		|		ПО ВедомостьДоговоры.Договор = сДоговоры.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВедомостьДоговоры.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СгрупировваняДатаДоговораПоВедомости.Ссылка КАК Ведомость
		|ПОМЕСТИТЬ ВТ_ВыборкаПоВедомостям
		|ИЗ
		|	ВТ_ТЧДоговоры КАК ВТ_ТЧДоговоры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СгрупировваняДатаДоговораПоВедомости КАК ВТ_СгрупировваняДатаДоговораПоВедомости
		|		ПО ВТ_ТЧДоговоры.Ссылка = ВТ_СгрупировваняДатаДоговораПоВедомости.Ссылка
		|			И ВТ_ТЧДоговоры.Дата = ВТ_СгрупировваняДатаДоговораПоВедомости.Дата
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Ведомость КАК Ведомость
		|		ПО ВТ_ТЧДоговоры.Ссылка = Ведомость.Ссылка
		|ГДЕ
		|	ЦЕЛ(ДЕНЬ(Ведомость.Дата) / 2) <> ДЕНЬ(Ведомость.Дата) / 2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыборкаПоВедомостям.Ведомость КАК Ведомость,
		|	ИсторияСтатусовДокументов.Статус КАК Статус
		|ИЗ
		|	ВТ_ВыборкаПоВедомостям КАК ВТ_ВыборкаПоВедомостям
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияСтатусовДокументов КАК ИсторияСтатусовДокументов
		|		ПО ВТ_ВыборкаПоВедомостям.Ведомость = ИсторияСтатусовДокументов.Документ
		|			И ВТ_ВыборкаПоВедомостям.Ведомость.Дата >= ИсторияСтатусовДокументов.ДатаЗаписи";   
	
	Запрос.УстановитьПараметр("ДатаСеанса",ТекущаяДатаСеанса());
	
	Если НЕ ЭтоРавно Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
									"И ВТ_ТЧДоговоры.Дата = ВТ_СгрупировваняДатаДоговораПоВедомости.Дата",
									"И ВТ_ТЧДоговоры.Дата <> ВТ_СгрупировваняДатаДоговораПоВедомости.Дата");
	КонецЕсли;
	
	Если ЭтоМаксимум Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
									"МИНИМУМ(сДоговоры.Дата) КАК Дата",
									"МАКСИМУМ(сДоговоры.Дата) КАК Дата");
	КонецЕсли; 
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
		
		НоваяСтрокаТЧ = ТЧВедомости.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ,ВыборкаДетальныеЗаписи);  
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Ведомости удалить
//
// Параметры:
//  ТЧВедомости	 - ТабличнаяЧасть - Табличная часть "Ведомости" с формы обработки
//
Процедура ВедомостиУдалить(ТЧВедомости) Экспорт
	
	ТабЧастьВедомости = ТЧВедомости.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВедомостиВыгрузка.Ведомость КАК Ведомость
		|ПОМЕСТИТЬ ВТ_ВедомостиВыгрузка
		|ИЗ
		|	&ВедомостиВыгрузка КАК ВедомостиВыгрузка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВедомостьДоговоры.Ссылка КАК Ведомость,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВедомостьДоговоры.Договор) КАК ДоговорКоличество
		|ПОМЕСТИТЬ ВТ_ВедомостиКоличество
		|ИЗ
		|	Документ.Ведомость.Договоры КАК ВедомостьДоговоры
		|
		|СГРУППИРОВАТЬ ПО
		|	ВедомостьДоговоры.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВедомостиВыгрузка.Ведомость КАК Ведомость,
		|	ВТ_ВедомостиКоличество.ДоговорКоличество КАК ДоговорКоличество,
		|	ИсторияСтатусовДокументов.Статус КАК Статус
		|ИЗ
		|	ВТ_ВедомостиВыгрузка КАК ВТ_ВедомостиВыгрузка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВедомостиКоличество КАК ВТ_ВедомостиКоличество
		|		ПО ВТ_ВедомостиВыгрузка.Ведомость = ВТ_ВедомостиКоличество.Ведомость
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияСтатусовДокументов КАК ИсторияСтатусовДокументов
		|		ПО ВТ_ВедомостиВыгрузка.Ведомость = ИсторияСтатусовДокументов.Документ"; 
	
	Запрос.УстановитьПараметр("ВедомостиВыгрузка",ТабЧастьВедомости);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТЧВедомости.Очистить(); 
	МассивВедомостиКУдалению = Новый Массив; 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
		
		Если ВыборкаДетальныеЗаписи.ДоговорКоличество %2 <> 0 Тогда
			СтрокаТЧ = ТЧВедомости.Добавить();	
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,ВыборкаДетальныеЗаписи);  
		Иначе
			МассивВедомостиКУдалению.Добавить(ВыборкаДетальныеЗаписи.Ведомость.Номер) ;
		КонецЕсли;	
		
	КонецЦикла;    
															
	НомераДоговоровСрока = СтрСоединить(МассивВедомостиКУдалению,",");																										
	ТекстСообщения = СтрШаблон("Удалено документов: %1 (%2).",МассивВедомостиКУдалению.Количество(),НомераДоговоровСрока);
		
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();   
	
КонецПроцедуры 
